{
  "requiredWords": [
    "abolish",
    "abortion",
    "absence",
    "absurd",
    "abuse",
    "academy",
    "accelerate",
    "acceptance",
    "accessible",
    "accomplishment",
    "accordingly",
    "accountability",
    "accountable",
    "accumulate",
    "accumulation",
    "accusation",
    "accused",
    "acid",
    "acquisition",
    "activation",
    "activist",
    "acute",
    "adaptation",
    "adhere",
    "adjacent",
    "adjustment",
    "administer",
    "administrative",
    "administrator",
    "admission",
    "adolescent",
    "adoption",
    "adverse",
    "advocate",
    "aesthetic",
    "affection",
    "aftermath",
    "aggression",
    "agricultural",
    "aide",
    "alert",
    "align",
    "alignment",
    "alike",
    "allegation",
    "allege",
    "allegedly",
    "alliance",
    "allocate",
    "allocation",
    "allowance",
    "ally",
    "aluminium",
    "amateur",
    "ambassador",
    "amend",
    "amendment",
    "amid",
    "analogy",
    "anchor",
    "anonymous",
    "apparel",
    "appealing",
    "appetite",
    "applaud",
    "applicable",
    "appoint",
    "appreciation",
    "arbitrary",
    "architectural",
    "archive",
    "arena",
    "arm",
    "array",
    "articulate",
    "ash",
    "aspiration",
    "aspire",
    "assassination",
    "assault",
    "assemble",
    "assembly",
    "assert",
    "assertion",
    "assurance",
    "asylum",
    "atrocity",
    "attain",
    "attendance",
    "attribute",
    "auction",
    "audit",
    "authentic",
    "authorise",
    "auto",
    "autonomy",
    "availability",
    "await",
    "backdrop",
    "backing",
    "backup",
    "bail",
    "ballot",
    "bankruptcy",
    "banner",
    "bare",
    "barrel",
    "battlefield",
    "bay",
    "beam",
    "beast",
    "behalf",
    "behavioural",
    "beloved",
    "bench",
    "benchmark",
    "beneficiary",
    "beneath",
    "betray",
    "betrayal",
    "beverage",
    "bind",
    "biography",
    "bishop",
    "bizarre",
    "blade",
    "blast",
    "bleed",
    "blend",
    "bless",
    "blessing",
    "boast",
    "bonus",
    "boom",
    "bounce",
    "boundary",
    "bow",
    "breach",
    "breakdown",
    "breakthrough",
    "breed",
    "broadband",
    "browser",
    "brutal",
    "buffer",
    "bulk",
    "burden",
    "bureaucracy",
    "burial",
    "cabinet",
    "calculation",
    "canvas",
    "capability",
    "capitalism",
    "capitalist",
    "cargo",
    "carriage",
    "carve",
    "casualty",
    "catalogue",
    "cater",
    "cattle",
    "caution",
    "cautious",
    "cease",
    "cemetery",
    "chamber",
    "chaos",
    "characterise",
    "charm",
    "charter",
    "choir",
    "chronic",
    "chunk",
    "circulate",
    "circulation",
    "citizenship",
    "civic",
    "civilian",
    "clarity",
    "clash",
    "classification",
    "cling",
    "clinical",
    "closure",
    "cluster",
    "coalition",
    "coastal",
    "cocktail",
    "cognitive",
    "coincide",
    "collaborate",
    "collaboration",
    "collective",
    "collision",
    "colonial",
    "columnist",
    "combat",
    "commence",
    "commentary",
    "commentator",
    "commerce",
    "commissioner",
    "commodity",
    "communist",
    "companion",
    "comparable",
    "compassion",
    "compel",
    "compelling",
    "compensate",
    "compensation",
    "competence",
    "competent",
    "compile",
    "complement",
    "complexity",
    "compliance",
    "complication",
    "comply",
    "composition",
    "comprise",
    "compromise",
    "compute",
    "conceal",
    "concede",
    "conceive",
    "conception",
    "concession",
    "condemn",
    "confer",
    "confession",
    "configuration",
    "confine",
    "confirmation",
    "confront",
    "confrontation",
    "congratulate",
    "congregation",
    "congressional",
    "conquer",
    "conscience",
    "consciously",
    "consciousness",
    "consecutive",
    "consensus",
    "consent",
    "conserve",
    "consistency",
    "consolidate",
    "consolidation",
    "constitute",
    "constitution",
    "constitutional",
    "constraint",
    "consultation",
    "contemplate",
    "contempt",
    "contend",
    "contender",
    "content",
    "contention",
    "continually",
    "contractor",
    "contradiction",
    "contrary",
    "contributor",
    "conversion",
    "convict",
    "conviction",
    "cooperate",
    "cooperative",
    "coordinate",
    "coordination",
    "coordinator",
    "copyright",
    "correction",
    "correlate",
    "correlation",
    "correspond",
    "correspondence",
    "correspondent",
    "corresponding",
    "correspondingly",
    "corrupt",
    "corruption",
    "costly",
    "councillor",
    "counselling",
    "counsellor",
    "counter",
    "counterpart",
    "countless",
    "coup",
    "courtesy",
    "craft",
    "crawl",
    "creator",
    "credibility",
    "credible",
    "creep",
    "criterion",
    "critique",
    "crown",
    "crude",
    "crush",
    "crystal",
    "cult",
    "cultivate",
    "curiosity",
    "custody",
    "cutting",
    "cynical",
    "dam",
    "damaging",
    "dawn",
    "debris",
    "debut",
    "decision-making",
    "decisive",
    "declaration",
    "dedicated",
    "dedication",
    "deed",
    "deem",
    "default",
    "defect",
    "defensive",
    "deficiency",
    "deficit",
    "definitive",
    "defy",
    "delegate",
    "delegation",
    "delicate",
    "demon",
    "denial",
    "denounce",
    "dense",
    "density",
    "dependence",
    "depict",
    "deploy",
    "deployment",
    "deprive",
    "deputy",
    "descend",
    "descent",
    "designate",
    "desirable",
    "destructive",
    "detain",
    "detection",
    "detention",
    "deteriorate",
    "devastate",
    "devise",
    "diagnose",
    "diagnosis",
    "dictate",
    "dictator",
    "differentiate",
    "dignity",
    "dilemma",
    "dimension",
    "diminish",
    "dip",
    "diplomat",
    "diplomatic",
    "directory",
    "disastrous",
    "discard",
    "discharge",
    "disclose",
    "disclosure",
    "discourse",
    "discretion",
    "discrimination",
    "disregard",
    "dismissal",
    "displace",
    "disposal",
    "dispose of",
    "dispute",
    "disrupt",
    "disruption",
    "dissolve",
    "distinction",
    "distinctive",
    "distort",
    "distress",
    "disturbing",
    "divert",
    "divine",
    "doctrine",
    "documentation",
    "domain",
    "dominance",
    "donor",
    "dose",
    "drawback",
    "drain",
    "drift",
    "drown",
    "dual",
    "dub",
    "dumb",
    "duo",
    "earnings",
    "ease",
    "echo",
    "ecological",
    "educator",
    "effectiveness",
    "efficiency",
    "ego",
    "elaborate",
    "electoral",
    "elevate",
    "eligible",
    "elite",
    "embark",
    "embarrassment",
    "embassy",
    "embed",
    "embody",
    "emergence",
    "empirical",
    "empower",
    "enact",
    "encompass",
    "encouragement",
    "encouraging",
    "endeavour",
    "endless",
    "endorse",
    "endorsement",
    "endure",
    "enforce",
    "enforcement",
    "engagement",
    "engaging",
    "enrich",
    "enrol",
    "enterprise",
    "enthusiast",
    "entitle",
    "entity",
    "epidemic",
    "equality",
    "equation",
    "erect",
    "escalate",
    "escort",
    "essence",
    "establishment",
    "eternal",
    "evacuate",
    "evoke",
    "evolutionary",
    "exaggerate",
    "excellence",
    "exceptional",
    "excess",
    "exclusion",
    "exclusive",
    "exclusively",
    "execute",
    "execution",
    "exert",
    "exile",
    "expenditure",
    "experimental",
    "expire",
    "explicit",
    "explicitly",
    "exploitation",
    "explosive",
    "extremist",
    "facilitate",
    "faction",
    "fade",
    "fairness",
    "fatal",
    "fate",
    "favourable",
    "feat",
    "felony",
    "feminist",
    "fibre",
    "fierce",
    "filmmaker",
    "filter",
    "firearm",
    "fiscal",
    "flaw",
    "flawed",
    "flee",
    "fleet",
    "flesh",
    "flexibility",
    "flourish",
    "fluid",
    "footage",
    "foresee",
    "foreigner",
    "forge",
    "formula",
    "formulate",
    "forth",
    "forthcoming",
    "foster",
    "fragile",
    "franchise",
    "frankly",
    "fraudulent",
    "frustrating",
    "frustration",
    "functional",
    "fundraising",
    "gambling",
    "gathering",
    "gaze",
    "gear",
    "generic",
    "genocide",
    "glance",
    "glimpse",
    "glorious",
    "glory",
    "governance",
    "grace",
    "grasp",
    "grave",
    "gravity",
    "grid",
    "grief",
    "grin",
    "grind",
    "grip",
    "gross",
    "guerrilla",
    "guidance",
    "guilt",
    "gut",
    "hail",
    "halfway",
    "halt",
    "handful",
    "handling",
    "handy",
    "harassment",
    "hardware",
    "harmony",
    "harsh",
    "harvest",
    "hatred",
    "haunt",
    "hazard",
    "hence",
    "heighten",
    "heritage",
    "hierarchy",
    "high-profile",
    "homeland",
    "hopeful",
    "horizon",
    "hostage",
    "hostile",
    "hostility",
    "humanitarian",
    "humanity",
    "humble",
    "hydrogen",
    "hypothesis",
    "identification",
    "ideological",
    "ideology",
    "ignorance",
    "imagery",
    "immense",
    "imminent",
    "implementation",
    "imprison",
    "inability",
    "inadequate",
    "inappropriate",
    "incarcerate",
    "incarceration",
    "incidence",
    "inclined",
    "inclusion",
    "incur",
    "indicator",
    "indictment",
    "indigenous",
    "induce",
    "indulge",
    "inequality",
    "infamous",
    "infect",
    "inflict",
    "influential",
    "infrastructure",
    "inherent",
    "inhibit",
    "initiate",
    "inject",
    "injection",
    "injustice",
    "inmate",
    "inquire",
    "insertion",
    "insider",
    "inspect",
    "inspection",
    "inspiration",
    "instinct",
    "institutional",
    "instruct",
    "instrumental",
    "insufficient",
    "insult",
    "intact",
    "intake",
    "integral",
    "integrated",
    "integration",
    "integrity",
    "intensify",
    "intensity",
    "intensive",
    "intent",
    "interactive",
    "interface",
    "interfere",
    "interference",
    "interim",
    "interior",
    "intermediate",
    "intersection",
    "intervene",
    "intervention",
    "intimate",
    "intriguing",
    "inventory",
    "investigator",
    "invisible",
    "invoke",
    "involvement",
    "ironic",
    "ironically",
    "irony",
    "irrelevant",
    "isolation",
    "judicial",
    "jurisdiction",
    "just",
    "justification",
    "landlord",
    "landmark",
    "lap",
    "large-scale",
    "latter",
    "lawmaker",
    "lawn",
    "lawsuit",
    "layout",
    "leak",
    "leap",
    "legacy",
    "legendary",
    "legislation",
    "legislative",
    "legislature",
    "legitimate",
    "lengthy",
    "lesbian",
    "lesser",
    "lethal",
    "liable",
    "liability",
    "liberal",
    "liberation",
    "liberty",
    "lifelong",
    "likelihood",
    "limb",
    "linear",
    "line-up",
    "linger",
    "listing",
    "literacy",
    "lobby",
    "logic",
    "long-standing",
    "long-time",
    "loom",
    "loop",
    "loyalty",
    "machinery",
    "magical",
    "magnetic",
    "magnitude",
    "mainland",
    "mainstream",
    "maintenance",
    "mandate",
    "mandatory",
    "manifest",
    "manipulate",
    "manipulation",
    "manuscript",
    "march",
    "marginal",
    "marine",
    "marketplace",
    "massacre",
    "mathematical",
    "mature",
    "maximise",
    "meaningful",
    "meantime",
    "medieval",
    "meditation",
    "melody",
    "memo",
    "memoir",
    "memorial",
    "mentor",
    "merchant",
    "mercy",
    "mere",
    "merely",
    "merge",
    "merger",
    "merit",
    "midst",
    "migration",
    "militant",
    "militia",
    "minimal",
    "minimise",
    "mining",
    "ministry",
    "minute",
    "miracle",
    "misery",
    "misleading",
    "mismanagement",
    "missile",
    "mob",
    "mobility",
    "mobilise",
    "moderate",
    "modification",
    "module",
    "momentum",
    "monk",
    "monopoly",
    "morality",
    "motive",
    "municipal",
    "mutual",
    "naive",
    "namely",
    "nationwide",
    "naval",
    "neglect",
    "neighbouring",
    "newsletter",
    "niche",
    "noble",
    "nod",
    "nominate",
    "nomination",
    "nominee",
    "nonetheless",
    "non-profit",
    "nonsense",
    "norm",
    "notable",
    "notably",
    "notify",
    "notorious",
    "nursery",
    "objection",
    "oblige",
    "obsess",
    "obsession",
    "occasional",
    "occurrence",
    "odds",
    "offering",
    "offspring",
    "operational",
    "opt",
    "optimism",
    "oral",
    "organisational",
    "orientation",
    "originate",
    "outbreak",
    "outing",
    "outlet",
    "outlook",
    "outrage",
    "outsider",
    "overlook",
    "overly",
    "oversee",
    "overturn",
    "overwhelm",
    "overwhelming",
    "parameter",
    "parental",
    "partial",
    "partially",
    "passing",
    "passive",
    "pastor",
    "patent",
    "pathway",
    "patrol",
    "patron",
    "peak",
    "peasant",
    "peculiar",
    "persist",
    "persistent",
    "personnel",
    "petition",
    "philosopher",
    "philosophical",
    "pioneer",
    "pipeline",
    "pit",
    "plausible",
    "plea",
    "plead",
    "pledge",
    "plunge",
    "pole",
    "poll",
    "portfolio",
    "portray",
    "postpone",
    "post-war",
    "practitioner",
    "preach",
    "precede",
    "precedent",
    "precision",
    "predator",
    "predecessor",
    "predominantly",
    "pregnancy",
    "prejudice",
    "preliminary",
    "premier",
    "premise",
    "premium",
    "prescribe",
    "prescription",
    "presently",
    "preservation",
    "preside",
    "presidency",
    "prestigious",
    "presumably",
    "presume",
    "prevail",
    "prevalence",
    "prevention",
    "prey",
    "privatization",
    "privilege",
    "probe",
    "problematic",
    "proceeding",
    "proceeds",
    "processing",
    "processor",
    "proclaim",
    "productive",
    "productivity",
    "profitable",
    "profound",
    "projection",
    "prominent",
    "pronounced",
    "propaganda",
    "proposition",
    "prosecute",
    "prosecution",
    "prosecutor",
    "prospective",
    "prosperity",
    "protective",
    "protocol",
    "province",
    "provincial",
    "provision",
    "provoke",
    "psychiatric",
    "pulse",
    "query",
    "quest",
    "quota",
    "radical",
    "rage",
    "raid",
    "rally",
    "ranking",
    "rape",
    "ratio",
    "rational",
    "ray",
    "readily",
    "realization",
    "realm",
    "rear",
    "reasoning",
    "reassure",
    "rebel",
    "rebellion",
    "recipient",
    "reconstruction",
    "recount",
    "recruitment",
    "referendum",
    "reflection",
    "reform",
    "refuge",
    "refusal",
    "regain",
    "regardless",
    "regime",
    "regulator",
    "regulatory",
    "rehabilitation",
    "reign",
    "rejection",
    "relevance",
    "reliability",
    "reluctant",
    "remainder",
    "remains",
    "remedy",
    "reminder",
    "removal",
    "render",
    "renew",
    "renowned",
    "rental",
    "replacement",
    "reportedly",
    "representation",
    "reproduce",
    "reproduction",
    "republic",
    "resemble",
    "reside",
    "residence",
    "residential",
    "residue",
    "resignation",
    "resistance",
    "respective",
    "respectively",
    "restoration",
    "restraint",
    "resume",
    "retreat",
    "retrieve",
    "revelation",
    "revenge",
    "reverse",
    "revival",
    "revive",
    "revolutionary",
    "rhetoric",
    "riot",
    "rip",
    "ritual",
    "robust",
    "rod",
    "rookie",
    "roster",
    "rotate",
    "rotation",
    "ruling",
    "rumour",
    "sacred",
    "sacrifice",
    "saint",
    "sake",
    "sanction",
    "saviour",
    "scenario",
    "scattered",
    "scope",
    "screw",
    "scrutiny",
    "seal",
    "secondly",
    "secular",
    "seemingly",
    "segment",
    "seize",
    "seldom",
    "selective",
    "sensation",
    "sensitivity",
    "sentiment",
    "separation",
    "serial",
    "settlement",
    "setup",
    "sexuality",
    "shareholder",
    "shatter",
    "shed",
    "sheer",
    "shipping",
    "shrink",
    "shrug",
    "sigh",
    "simulate",
    "simulation",
    "simultaneously",
    "sin",
    "situated",
    "sceptical",
    "sketch",
    "slash",
    "slavery",
    "slot",
    "smash",
    "snap",
    "soak",
    "soar",
    "socialist",
    "sole",
    "solely",
    "solidarity",
    "solo",
    "sovereignty",
    "span",
    "spark",
    "specialised",
    "specification",
    "specimen",
    "spectacle",
    "spectrum",
    "sphere",
    "spin",
    "spine",
    "spotlight",
    "spouse",
    "squad",
    "squeeze",
    "stab",
    "stability",
    "stabilise",
    "stake",
    "standing",
    "stark",
    "statistical",
    "steer",
    "stem from",
    "stereotype",
    "stimulus",
    "stir",
    "storage",
    "straightforward",
    "strain",
    "strand",
    "strategic",
    "strip",
    "strive",
    "structural",
    "stumble",
    "stun",
    "submission",
    "subscriber",
    "subscription",
    "subsequent",
    "subsequently",
    "subsidy",
    "substantial",
    "substantially",
    "substitute",
    "substitution",
    "subtle",
    "suburban",
    "succession",
    "successive",
    "successor",
    "suck",
    "sue",
    "suicide",
    "suite",
    "summit",
    "superb",
    "superintendent",
    "superior",
    "supervise",
    "supervision",
    "supervisor",
    "supplement",
    "supportive",
    "supposedly",
    "suppress",
    "supreme",
    "surge",
    "surgical",
    "surplus",
    "surrender",
    "surveillance",
    "suspension",
    "suspicion",
    "suspicious",
    "sustain",
    "symbolic",
    "syndrome",
    "synthesis",
    "systematic",
    "tackle",
    "tactic",
    "tactical",
    "taxpayer",
    "tempt",
    "tenant",
    "tender",
    "tenure",
    "terminate",
    "terrain",
    "terrific",
    "testify",
    "testimony",
    "texture",
    "thankfully",
    "theatrical",
    "theology",
    "theoretical",
    "thereafter",
    "thereby",
    "thesis",
    "thoughtful",
    "thread",
    "threshold",
    "thrilled",
    "thrive",
    "tide",
    "tighten",
    "timber",
    "timely",
    "tobacco",
    "tolerance",
    "tolerate",
    "toll",
    "torture",
    "toss",
    "trademark",
    "trail",
    "traitor",
    "transaction",
    "transcript",
    "transformation",
    "transit",
    "transmission",
    "transparency",
    "transparent",
    "trauma",
    "treaty",
    "tremendous",
    "tribal",
    "tribute",
    "trigger",
    "trio",
    "triumph",
    "trophy",
    "troubled",
    "trustee",
    "tuition",
    "tumour",
    "turnout",
    "turnover",
    "twist",
    "unconstitutional",
    "undergraduate",
    "underlying",
    "undermine",
    "undoubtedly",
    "unify",
    "unprecedented",
    "unveil",
    "upcoming",
    "upgrade",
    "uphold",
    "utility",
    "utilise",
    "utterly",
    "vacuum",
    "vague",
    "validity",
    "vanish",
    "variable",
    "varied",
    "vein",
    "venture",
    "verbal",
    "verdict",
    "verify",
    "verse",
    "versus",
    "vessel",
    "veteran",
    "viable",
    "vibrant",
    "vice",
    "vicious",
    "violate",
    "violation",
    "virtue",
    "vocal",
    "vow",
    "vulnerability",
    "vulnerable",
    "ward",
    "warehouse",
    "warfare",
    "warrant",
    "warrior",
    "weaken",
    "weave",
    "weed",
    "well",
    "well-being",
    "whatsoever",
    "whip",
    "wholly",
    "widen",
    "width",
    "willingness",
    "wipe",
    "wit",
    "withdrawal",
    "workout",
    "worship",
    "worthwhile",
    "worthy",
    "wrongdoing",
    "yield"
  ],
  "meaningOverrides": {
    "academy": "a school or institution for advanced learning or special training",
    "abolish": "to officially end a law, system, or practice",
    "abortion": "the medical ending of a pregnancy",
    "absence": "the state of not being present",
    "abuse": "the harmful or unfair use of something or someone",
    "allocate": "to assign resources for a specific purpose",
    "allocation": "the act of distributing resources",
    "broadband": "a high-speed internet connection",
    "browser": "software used to access websites",
    "bounce": "to spring back after hitting a surface",
    "citizenship": "the legal status and rights of being a citizen",
    "confront": "to face and deal with a difficult situation or person directly",
    "conserve": "to protect and use carefully",
    "constitution": "the core legal principles of a country",
    "ecological": "related to the natural environment",
    "educator": "a person who teaches or supports learning",
    "hypothesis": "a testable explanation for an observation",
    "interface": "the point where users interact with a system",
    "inequality": "an unfair difference in status or opportunity",
    "legislation": "laws or rules made by a government",
    "literacy": "the ability to read, write, and use knowledge effectively",
    "logic": "reasoning based on clear and valid thinking",
    "prejudice": "an unfair opinion formed without full knowledge",
    "productivity": "the rate of effective output or work",
    "plausible": "seeming reasonable or likely to be true",
    "province": "one of the main administrative regions of a country",
    "reform": "a change intended to improve a system",
    "robust": "strong and likely to remain effective",
    "straightforward": "easy to understand and direct",
    "subtle": "not obvious, but important or noticeable",
    "sustain": "to continue over time",
    "supervise": "to monitor and guide work",
    "thesis": "a formal academic argument or research paper",
    "verdict": "the official decision in a court case"
  },
  "exampleOverrides": {
    "academy": "She enrolled in an academy to improve her design skills.",
    "bounce": "The ball will bounce high when it hits the hard floor.",
    "confront": "Leaders must confront problems early before they become crises.",
    "plausible": "Her explanation sounded plausible, so the team accepted it.",
    "province": "The province introduced new policies to support local farmers."
  }
}
